perf/heavy/stress.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555/node'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Subida
      duration: 30
      arrivalRate: 0
      rampTo: 600

    - name: Constante
      duration: 500
      arrivalRate: 600

    
scenarios:
  - name: Heavy Stress (/heavy)
    flow:
      - get:
          url: '/heavy'